{
    "_id": "LL0_1488_parkinsons",
    "about": {
        "problemID": "LL0_1488_parkinsons_problem",
        "problemName": "parkinsons_problem",
        "problemDescription": "**Author**:   \n**Source**: UCI\n**Please cite**: 'Exploiting Nonlinear Recurrence and Fractal Scaling Properties for Voice Disorder Detection', Little MA, McSharry PE, Roberts SJ, Costello DAE, Moroz IM. BioMedical Engineering OnLine 2007, 6:23 (26 June 2007) \n\n* Abstract: \n\nOxford Parkinson's Disease Detection Dataset\n\n* Source:\n\nThe dataset was created by Max Little of the University of Oxford, in collaboration with the National Centre for Voice and Speech, Denver, Colorado, who recorded the speech signals. The original study published the feature extraction methods for general voice disorders.\n\n* Data Set Information:\nThis dataset is composed of a range of biomedical voice measurements from 31 people, 23 with Parkinson's disease (PD). Each column in the table is a particular voice measure, and each row corresponds one of 195 voice recording from these individuals (\"name\" column). The main aim of the data is to discriminate healthy people from those with PD, according to \"status\" column which is set to 0 for healthy and 1 for PD. \n\nFurther details are contained in the following reference -- if you use this dataset, please cite: \nMax A. Little, Patrick E. McSharry, Eric J. Hunter, Lorraine O. Ramig (2008), 'Suitability of dysphonia measurements for telemonitoring of Parkinson's disease', IEEE Transactions on Biomedical Engineering (to appear).\n\n\n* Attribute Information:\n\nMatrix column entries (attributes): \nname - ASCII subject name and recording number \nMDVP:Fo(Hz) - Average vocal fundamental frequency \nMDVP:Fhi(Hz) - Maximum vocal fundamental frequency \nMDVP:Flo(Hz) - Minimum vocal fundamental frequency \nMDVP:Jitter(%),MDVP:Jitter(Abs),MDVP:RAP,MDVP:PPQ,Jitter:DDP - Several measures of variation in fundamental frequency \nMDVP:Shimmer,MDVP:Shimmer(dB),Shimmer:APQ3,Shimmer:APQ5,MDVP:APQ,Shimmer:DDA - Several measures of variation in amplitude \nNHR,HNR - Two measures of ratio of noise to tonal components in the voice \nstatus - Health status of the subject (one) - Parkinson's, (zero) - healthy \nRPDE,D2 - Two nonlinear dynamical complexity measures \nDFA - Signal fractal scaling exponent \nspread1,spread2,PPE - Three nonlinear measures of fundamental frequency variation",
        "taskType": "classification",
        "taskSubType": "binary",
        "problemVersion": "1.0",
        "problemSchemaVersion": "3.0"
    },
    "inputs": {
        "data": [
            {
                "datasetID": "LL0_1488_parkinsons_dataset",
                "targets": [
                    {
                        "targetIndex": 0,
                        "resID": "0",
                        "colIndex": 23,
                        "colName": "Class"
                    }
                ]
            }
        ],
        "dataSplits": {
            "method": "holdOut",
            "testSize": 0.2,
            "stratified": true,
            "numRepeats": 0,
            "randomSeed": 42,
            "splitsFile": "dataSplits.csv"
        },
        "performanceMetrics": [
            {
                "metric": "f1Macro"
            }
        ]
    },
    "expectedOutputs": {
        "predictionsFile": "predictions.csv"
    }
}