{
    "_id": "LL0_567_kdd_coil_1",
    "about": {
        "datasetID": "LL0_567_kdd_coil_1_dataset",
        "datasetName": "LL0_567_kdd_coil_1",
        "description": "**Author**:   \n**Source**: Unknown - Date unknown  \n**Please cite**:   \n\n%%%%%%%%%%%%%%%%%%%\nData-Description %\n%%%%%%%%%%%%%%%%%%%\n\nCOIL 1999 Competition Data\n\nData Type\n\nmultivariate\n\nAbstract\n\nThis data set is from the 1999 Computational Intelligence and Learning\n(COIL) competition. The data contains measurements of river chemical\nconcentrations and algae densities.\n\nSources\n\nOriginal Owner\n\n[1]ERUDIT\nEuropean Network for Fuzzy Logic and Uncertainty Modelling\nin Information Technology\n\nDonor\n\nJens Strackeljan\nTechnical University Clausthal\nInstitute of Applied Mechanics\nGraupenstr. 3, 38678 Clausthal-Zellerfeld, Germany\n[2]tmjs@itm.tu-clausthal.de\n\nDate Donated: September 9, 1999\n\nData Characteristics\n\nThis data comes from a water quality study where samples were taken\nfrom sites on different European rivers of a period of approximately\none year. These samples were analyzed for various chemical substances\nincluding: nitrogen in the form of nitrates, nitrites and ammonia,\nphosphate, pH, oxygen, chloride. In parallel, algae samples were\ncollected to determine the algae population distributions.\n\nOther Relevant Information\n\nThe competition involved the prediction of algal frequency\ndistributions on the basis of the measured concentrations of the\nchemical substances and the global information concerning the season\nwhen the sample was taken, the river size and its flow velocity. The\ncompetition [3]instructions contain additional information on the\nprediction task.\n\nData Format\n\nThere are a total of 340 examples each containing 17 values. The first\n11 values of each data set are the season, the river size, the fluid\nvelocity and 8 chemical concentrations which should be relevant for\nthe algae population distribution. The last 8 values of each example\nare the distribution of different kinds of algae. These 8 kinds are\nonly a very small part of the whole community, but for the competition\nwe limited the number to 7. The value 0.0 means that the frequency is\nvery low. The data set also contains some empty fields which are\nlabeled with the string XXXXX.\n\nThe training data are saved in the file: analysis.data (ASCII format).\n\nTable 1: Structure of the file analysis.data\n\nA\n\n\nK\n\na\n\n\ng\n\nCC[1,1]\n\n\nCC[1,11]\n\nAG[1,1]\n\n\nAG[1,7]\n\nCC[200,1]\n\n\nCC[200,11]\n\nAG[200,1]\n\n\nAG[200,7]\n\nExplanation:\nCC[i,j]: Chemical concentration or river characteristic\nAG[i,j]: Algal frequency\n\nThe chemical parameters are labeled as A, ..., K. The columns of the\nalgaes are labeled as a, ..,g.\n\nPast Usage\n\n[4]The Third (1999) International COIL Competition Home Page\n_________________________________________________________________\n\n\n[5]The UCI KDD Archive\n[6]Information and Computer Science\n[7]University of California, Irvine\nIrvine, CA 92697-3425\n\nLast modified: October 13, 1999\n\nReferences\n\n1. http://www.erudit.de/\n2. mailto:tmjs@itm.tu-clausthal.de\n3. file://localhost/research/ml/datasets/uci/raw/data/ucikdd/coil/instructions.txt\n4. http://www.erudit.de/erudit/activities/ic-99/index.htm\n5. http://kdd.ics.uci.edu/\n6. http://www.ics.uci.edu/\n7. http://www.uci.edu/\n\n%%%%%%%%%%%%%%%%%%%\nTask-Description %\n%%%%%%%%%%%%%%%%%%%\n\n\nThird International Competition\n\nProtecting rivers and streams by monitoring chemical concentrations and\nalgae communities.\n\n\nIntelligent Techniques for Monitoring Water Quality using chemical\nindicators and algae population\n\nRecent years have been characterised by increasing concern at the\nimpact man is having on the environment.\nThe impact on the environment of toxic waste, from a wide variety\nof manufacturing processes, is well known. More recently, however,\nit has become clear that the more subtle effects of nutrient level\nand chemical balance changes arising from farming land run-off and\nsewage water treatment also have a serious, but indirect, effect on\nthe states of rivers, lakes and even the sea.  In temperate climates\nacross the world summers are characterized by numerous reports excessive\nsummer algae growth resulting in poor water clarity, mass deaths of\nriver fish from reduced oxygen levels and the closure of recreational\nwater facilities on account of the toxic effects of this annual algal bloom.\nReducing the impact of these man-made changes in river nutrient levels\nhas stimulated much biological research with the aim of identifying\nthe crucial chemical control variables for the biological\nprocesses.\n\nThe data used in this problem comes from one such study.\nDuring the research study water quality samples were\ntaken from sites on different European rivers of a period of\napproximately one year.  These samples were analyzed for various\nchemical substances including: nitrogen in the form of nitrates,\nnitrites and ammonia, phosphate, pH, oxygen, chloride.\nIn parallel, algae samples were collected to determine the algae population\ndistributions. It is well known that the dynamics of the\nalgae community is determined by external chemical\nenvironment with one or more factors being predominant.\nWhile the chemical analysis is cheap and easily\nautomated, the biological part involves microscopic examination,\nrequires trained manpower and is therefore both\nexpensive and slow.\n\nDiatoms like Cymbella are major contributors to primary production\nthroughout the world. The diatom reacts with\nlarge sensitivity to even small changes in acidity .\n\nOver a three and half billion year history algae have evolved and\nadapted as primary plant colonizers of almost\nevery known habitant in terrestrial and aquatic environments.\nThey respond very rapidly to man-made environment changes.\n\n\n\nThe relationship between the chemical and biological features is\ncomplex and can be expected to need the application of advanced\ntechniques. Typical of such real-life problems, the particular\ndata set for the problem contains a mixture of (fuzzy) qualiative\nvariables and numerical measurement values, with much of the data\nbeing incomplete.\n\nThe competition task is the prediction of algal frequency distributions\non the basis of  the measured concentrations of the chemical\nsubstances and the global information concerning the season when the sample\nwas taken, the river size and its flow velocity. The two last variables\nare given as linguistic variables.\n\n340 data sets were taken and each contain 17 values. The\nfirst 11 values of each data set are the season, the river\nsize, the fluid velocity and 8 chemical concentrations which\nshould be relevant for the algae population distribution.\nThe last 8 values of each data set are the distribution of\ndifferent kinds of algae. These 8 kinds are only a very small\npart of the whole community, but for the competition we limited\nthe number to 7. The value 0.0 means that the frequency is very low.\nThe data set also contains some empty fields which are labeled\nwith the string XXXXX.\n\nEach participant in the competition receives 200 complete data sets\n(training data) and 140 data sets (evaluation data) containing only\nthe 11 values of the river descriptions and the chemical concentrations.\n\nThis training data is to be used in obtainin\na 'model' providing a prediction of the algal distributions associated\nwith the evaluation data.\n\n\n\nThe training data are saved in the file:\n\nanalysis.txt (ASCII format).\n\nStructure of the file analysis.txt\n\nA                          K              a                   g\nCC1,1   ...                CC1,11         AG1,1    ...        AG1,7\n....                        ...            ...                 ...\n\n\nCC200,1 ...                CC200,11       AG240,1  ...        AG240,7\n\n\nExplanation:\nCCi,j:  Chemical concentration    j=1,..11\nAGi,k: Algal frequency            k=1...7\n\n\nThe chemical parameters are labeled as A, ..., K.\nThe columns of the algaes are labeled as a, ..,g.\n\n\nEvaluation data are saved in file eval.txt (ASCII format).\n\n\nTable 2: Structure of the file eval.*\nA                               K\nCC1,1     ...                   CC1,11\n\n.....                            ...\n\nCC140,1   ...                   CC140,11\n\n_____________________________________________________________\n\nObjective\n\nThe objective of the competition is to provide a prediction\nmodel on basis of the training data. Having obtained this\nprediction model, each participant must provide the solution\nin the form of the results of applying this model to the\nevaluation data. The results obtained in this way should\ncorrespond to the results of the evaluation data\n(which are known to the organizer). The criteria used to evaluate\nthe results is given below.\nAll 7 Algae frequency distributions must be determined.\nFor this purpose any number of partial models may be developed.\n\n_____________________________________________________________\n\nJudgment of the results\n\nTo judge the results, the sum of squared errors will be calculated.\nThe following Table describes the results of a particular participant.\n\nMatrix of results\na                     g\n\nRes1,1   ...          Res1,7\n\n....                   ...\n\nRes140,1              Res140,7\n\n\nAll solutions that lead to a smallest total error will\nbe regarded as winner of the contest.\n\n\n\nInformation about the dataset\nCLASSTYPE: numeric\nCLASSINDEX: last\n\nALGAE #: 1/7",
        "citation": "\n\t\t\t\t@article{OpenML2013,\n\t\t\t\tauthor = {Vanschoren, Joaquin and van Rijn, Jan N. and Bischl, Bernd and Torgo, Luis},\n\t\t\t\ttitle = {OpenML: Networked Science in Machine Learning},\n\t\t\t\tjournal = {SIGKDD Explorations},\n\t\t\t\tvolume = {15},\n\t\t\t\tnumber = {2},\n\t\t\t\tyear = {2013},\n\t\t\t\tpages = {49--60},\n\t\t\t\turl = {http://doi.acm.org/10.1145/2641190.2641198},\n\t\t\t\tdoi = {10.1145/2641190.2641198},\n\t\t\t\tpublisher = {ACM},\n\t\t\t\taddress = {New York, NY, USA},\n\t\t\t\t}",
        "license": "CC-BY license",
        "source": "OpenML",
        "sourceURI": "http://www.openml.org/d/567",
        "approximateSize": "",
        "datasetSchemaVersion": "3.0",
        "redacted": false,
        "datasetVersion": "1.0"
    },
    "dataResources": [
        {
            "resID": "0",
            "resPath": "tables/learningData.csv",
            "resType": "table",
            "resFormat": [
                "text/csv"
            ],
            "isCollection": false,
            "columns": [
                {
                    "colIndex": 0,
                    "colName": "d3mIndex",
                    "colType": "integer",
                    "role": [
                        "index"
                    ]
                },
                {
                    "colIndex": 1,
                    "colName": "season",
                    "colType": "categorical",
                    "role": [
                        "attribute"
                    ]
                },
                {
                    "colIndex": 2,
                    "colName": "river_size",
                    "colType": "categorical",
                    "role": [
                        "attribute"
                    ]
                },
                {
                    "colIndex": 3,
                    "colName": "fluid_velocity",
                    "colType": "categorical",
                    "role": [
                        "attribute"
                    ]
                },
                {
                    "colIndex": 4,
                    "colName": "concentration_1",
                    "colType": "real",
                    "role": [
                        "attribute"
                    ]
                },
                {
                    "colIndex": 5,
                    "colName": "concentration_2",
                    "colType": "real",
                    "role": [
                        "attribute"
                    ]
                },
                {
                    "colIndex": 6,
                    "colName": "concentration_3",
                    "colType": "real",
                    "role": [
                        "attribute"
                    ]
                },
                {
                    "colIndex": 7,
                    "colName": "concentration_4",
                    "colType": "real",
                    "role": [
                        "attribute"
                    ]
                },
                {
                    "colIndex": 8,
                    "colName": "concentration_5",
                    "colType": "real",
                    "role": [
                        "attribute"
                    ]
                },
                {
                    "colIndex": 9,
                    "colName": "concentration_6",
                    "colType": "real",
                    "role": [
                        "attribute"
                    ]
                },
                {
                    "colIndex": 10,
                    "colName": "concentration_7",
                    "colType": "real",
                    "role": [
                        "attribute"
                    ]
                },
                {
                    "colIndex": 11,
                    "colName": "concentration_8",
                    "colType": "real",
                    "role": [
                        "attribute"
                    ]
                },
                {
                    "colIndex": 12,
                    "colName": "algae_1",
                    "colType": "real",
                    "role": [
                        "suggestedTarget"
                    ]
                }
            ]
        }
    ]
}